src/Assets/SalamAirRequestTemplates/SaveReserve.xml


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:rad="http://schemas.datacontract.org/2004/07/Radixx.ConnectPoint.Request" xmlns:rad1="http://schemas.datacontract.org/2004/07/Radixx.ConnectPoint.Reservation.Request">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:CreatePNR>
         <!--Optional:-->
         <tem:CreatePnrRequest>
            <rad:SecurityGUID>{{SecurityGUID_FAREID}}</rad:SecurityGUID>
            <rad:CarrierCodes>
               <!--Zero or more repetitions:-->
               <rad:CarrierCode>
                  <rad:AccessibleCarrierCode>OV</rad:AccessibleCarrierCode>
               </rad:CarrierCode>
            </rad:CarrierCodes>
            <!--Optional:-->
            <rad:ClientIPAddress></rad:ClientIPAddress>
            <!--Optional:-->
            <rad:HistoricUserName>{{USERNAME_}}</rad:HistoricUserName>
            <rad1:ActionType>SaveReservation</rad1:ActionType>
            <rad1:ReservationInfo>
               <rad:SeriesNumber>299</rad:SeriesNumber>
               <rad:ConfirmationNumber>{{ConfirmationNumber}}</rad:ConfirmationNumber>
            </rad1:ReservationInfo>
         </tem:CreatePnrRequest>
      </tem:CreatePNR>
   </soapenv:Body>
</soapenv:Envelope>